cf_billing/Documents/энргИзменитьПризнакРасчетаТолькоПоПоказаниям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргИзменитьПризнакРасчетаТолькоПоПоказаниям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргСвойствоРасчетТолькоПоПоказаниямТочекУчета</xr:Item>
				<xr:Item>InformationRegister.энргТехническаяВозможностьУстановкиПУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчетТолькоПоПоказаниям</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргИзменитьПризнакРасчетаТолькоПоПоказаниям/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 Булево - Ложь, функция не работает.
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Ложь;

КонецФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
			
КонецПроцедуры

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодами

// Получает изменяемые параметры расчета.
// 
// Возвращаемое значение:
//   Соответсвие.
//
Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета 		= Новый Соответствие;
	ИзменяемыеПараметры 			= Новый Массив;
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета","РасчетТолькоПоПоказаниям"));
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(),ИзменяемыеПараметры); 
	Возврат ИзменяемыеПараметрыРасчета;	
КонецФункции

// Получает данные для проведения по стабильным периодам.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив из Строка.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт 
	
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовИзменитьПризнакРасчетаТолькоПоПоказаниям";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодам());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область РеализацияИнтерефейса_Проведение

// Инициализирует данные документа.
//
// Параметры:
//  ДокументСсылка			-	ДокументСсылка.энргИзменитьПризнакРасчетаТолькоПоПоказаниям.
//  ДополнительныеСвойства	-	Структура.
//  Регистры				-	Произвольный.
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
		
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	
	ДобавитьТекстЗапросаСвойствоРасчетТолькоПоПоказаниямТочекУчета(Схема, Регистры);
	ДобавитьТекстЗапросаТехническаяВозможностьУстановкиПУ(Схема, Регистры);
		
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	Запрос  						= Новый Запрос(Схема.ПолучитьТекстЗапроса());
	Запрос.УстановитьПараметр("мДокументы", 					ДокументСсылка);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", 	Новый УникальныйИдентификатор());
	
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		энргФормированиеТекстовЗапроса.УстановитьПараметрыТаблицыПодмены(Запрос, ВспомогательныеПараметры); 
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		Запрос.ВыполнитьПакет());
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область РеализацияИнтрейфеса_КонтрольПроведения

// Инициализирует таблицы для контроля.
//
// Параметры:
//  ДокументСсылка			-	ДокументСсылка.энргИзменитьПризнакРасчетаТолькоПоПоказаниям.
//  ДополнительныеСвойства	-	Структура.
//
Процедура ИнициализироватьТаблицыДляКонтроля(ДокументСсылка,ДополнительныеСвойства) Экспорт 
	
	Схема  										= Неопределено;
	Параметры 									= Новый Структура;
			
	КлючиТаблицКонтроля  						= Новый Структура;
				
	ДополнительныеСвойства.Вставить("ТаблицыДляКонтроля", 					Новый Массив);
	ДополнительныеСвойства.Вставить("КлючиТаблицКонтроля", 					КлючиТаблицКонтроля);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьТекстЗапросаСвойствоРасчетТолькоПоПоказаниямТочекУчета(Схема, Регистры)
	
	ИмяРегистра = "энргСвойствоРасчетТолькоПоПоказаниямТочекУчета";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	табТочкиУчета.РасчетТолькоПоПоказаниям
	|ИЗ
	|	Документ.энргИзменитьПризнакРасчетаТолькоПоПоказаниям КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменитьПризнакРасчетаТолькоПоПоказаниям.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаТехническаяВозможностьУстановкиПУ(Схема, Регистры)
	
	ИмяРегистра = "энргТехническаяВозможностьУстановкиПУ";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[1];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА НЕ Шапка.ДатаФактическогоСобытия = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА Шапка.ДатаФактическогоСобытия
	|		ИНАЧЕ Шапка.Дата
	|	КОНЕЦ КАК Период,
	|	Шапка.Организация КАК Организация,
	|	Шапка.Район КАК Район,
	|	Шапка.КлючПомещения КАК КлючПомещения,
	|	табТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	Шапка.Дата КАК ПериодРегистрации,
	|	НАЧАЛОПЕРИОДА(Шапка.ПериодНачисления, МЕСЯЦ) КАК ПериодНачисления,
	|	табТочкиУчета.РасчетТолькоПоПоказаниям
	|ИЗ
	|	Документ.энргИзменитьПризнакРасчетаТолькоПоПоказаниям КАК Шапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменитьПризнакРасчетаТолькоПоПоказаниям.ТочкиУчета КАК табТочкиУчета
	|		ПО Шапка.Ссылка = табТочкиУчета.Ссылка
	|			И (Шапка.Ссылка В (&мДокументы))
	|			И (табТочкиУчета.Ссылка В (&мДокументы))";	
	
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Функция ТекстДляПроведенияПоСтабильнымПериодам() 
	Текст 		=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ЗНАЧЕНИЕ(Перечисление.энргВидыОпераций.ПустаяСсылка) КАК ВидОперации,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочкиУчета.РасчетТолькоПоПоказаниям КАК РасчетТолькоПоПоказаниям,
	|	0 КАК Порядок
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменитьПризнакРасчетаТолькоПоПоказаниям.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочкиУчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргИзменитьПризнакРасчетаТолькоПоПоказаниям КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка";
	
	Возврат Текст;

КонецФункции

#КонецОбласти

#КонецЕсли
